app/Models/Machine/MachineModel.php

    public function all_machine($whereCondition)
    {
        $builder = $this->db->table('pp_machine_master m');

        $builder->select('
            m.*
        ');

        if (!empty($whereCondition)) {
            $builder->where($whereCondition);
        }

        $builder->orderBy('m.PP_ID', 'DESC');

        $query = $builder->get();
---
SELECT `m`.*
FROM `pp_machine_master` `m`
WHERE `PP_ID` = '7'
ORDER BY `m`.`PP_ID` DESC