app/Models/Material/MaterialModel.php

SELECT `m`.*
FROM `pp_finish_material_master` `m`
ORDER BY `m`.`ID` DESC
---
    public function all_material($whereCondition)
    {
        $builder = $this->db->table('pp_finish_material_master m');

        $builder->select('
            m.*
        ');

        if (!empty($whereCondition)) {
            $builder->where($whereCondition);
        }

        $builder->orderBy('m.ID', 'DESC');

        $query = $builder->get();