app/Models/Material/MRMaterialModel.php

    public function all_material($whereCondition)
    {
        $builder = $this->db->table('pp_mr_material_master m');

        $builder->select('
            m.*
        ');

        if (!empty($whereCondition)) {
            $builder->where($whereCondition);
        }

        $builder->orderBy('m.PP_ID', 'DESC');

        $query = $builder->get();
---
SELECT `m`.*
FROM `pp_mr_material_master` `m`
WHERE `PP_ID` = '12'
ORDER BY `m`.`PP_ID` DESC